In [63]:
import numpy as np
import pandas as pd
pd.set_option('display.max_columns', 500)

In [57]:
# Reading the data
wholesale = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/OkbnaOBqrBXZOpRQw1JGMgaM9/Wholesale_Data.csv')
wholesale.head()

   Fresh  Milk  Grocery  Frozen  Detergents_Paper  Delicassen Channel
0  12669  9656     7561     214              2674        1338    Cafe
1   7057  9810     9568    1762              3293        1776     Hot
2   6353  8808     7684    2405              3516        7844   Hotel
3  13265  1196     4221    6404               507        1788       C
4  22615  5410     7198    3915              1777        5185       H

In [58]:
wholesale['Channel'].value_counts()

H             47
Cafe          45
Caffe         42
R             42
C             36
Hote          35
Hotel         32
Hot           32
Restaurant    30
Rest          29
Name: Channel, dtype: int64

There are only three types of channels - 'Hotel', 'Restaurant', and 'Cafe'.
Inspect the incorrect values in the Channel column and replace them with their actual full names.

In [59]:
def fullChannelName(channelName):
    incorrectCafe = ['C','Caffe']
    incorrectHotel = ['H','Hote','Hot']
    incorrectRestrau = ['R','Rest']
    
    if channelName in incorrectCafe:
        return "Cafe"
    elif channelName in incorrectRestrau:
        return "Restaurant"
    elif channelName in incorrectHotel:
        return "Hotel"
    else:
        return channelName
    
wholesale['Channel'] = wholesale['Channel'].apply(lambda x: fullChannelName(x))

In [60]:
wholesale['Channel'].value_counts()

Hotel         146
Cafe          123
Restaurant    101
Name: Channel, dtype: int64

In [61]:
wholesale.head()

   Fresh  Milk  Grocery  Frozen  Detergents_Paper  Delicassen Channel
0  12669  9656     7561     214              2674        1338    Cafe
1   7057  9810     9568    1762              3293        1776   Hotel
2   6353  8808     7684    2405              3516        7844   Hotel
3  13265  1196     4221    6404               507        1788    Cafe
4  22615  5410     7198    3915              1777        5185   Hotel

Each of the columns except for the column 'Channel' tells you the sales for each kind of product and the 'Channel' column tells you which 'Channel' you're selling to. Your task is to find out which of the three channels has the least total sales (for all the products combined). For example, if the total sales to Cafe, Hotel, and Restaurant turn out to be 1 lakh, 2 lakh, and 3 lakh rupees, you need to print 'Cafe' since it has the lowest sales.

In [62]:
data_columns_total = pd.DataFrame(wholesale.groupby(by = 'Channel')['Fresh','Milk','Grocery','Frozen','Detergents_Paper','Delicassen'].sum())
data_columns_total['Total'] = data_columns_total.sum(axis=1)
data_columns_total = data_columns_total.sort_values(by = 'Total')
print(data_columns_total.index[0])

Restaurant

Selecting dataframe columns
Description
Write a program to select all columns of a dataframe except the ones specified.
The input will contain a list of columns that you should skip.
You should print the first five rows of the dataframe as output where the columns are alphabetically sorted.

Sample Input:
['PassengerId', 'Pclass', 'Name', 'Sex','Embarked']

In [69]:
import pandas as pd
import ast
df=pd.read_csv("https://media-doselect.s3.amazonaws.com/generic/X0kvr3wEYXRzONE5W37xWWYYA/test.csv")
to_omit = ast.literal_eval(input())

pd.set_option('display.max_columns', 500)

df[df.columns[~df.columns.isin(to_omit)]]

['PassengerId', 'Pclass', 'Name', 'Sex','Embarked']

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [92]:
cols = list(df.columns[~df.columns.isin(to_omit)])
cols.sort()
cols
print(df[cols].head())

#another solution
#df=df[df.columns[~df.columns.isin(to_omit)]]
#print(df.loc[:, sorted(list(df.columns))].head())

    Age Cabin     Fare  Parch  SibSp   Ticket
0  34.5   NaN   7.8292      0      0   330911
1  47.0   NaN   7.0000      0      1   363272
2  62.0   NaN   9.6875      0      0   240276
3  27.0   NaN   8.6625      0      0   315154
4  22.0   NaN  12.2875      1      1  3101298

### Two series
Description
Given two pandas series, find the position of elements in series2 in series1.
You can assume that all elements in series2 will be present in series1.
The input will contain two lines with series1 and series2 respectively.
The output should be a list of indexes indicating elements of series2 in series 1.
Note: In the output list, the indexes should be in ascending order.

Sample Input:

[1,2,3,4,5,6,7]

[1,3,7]

Sample Output:

[0,2,6]

In [107]:
import ast
input_list = ast.literal_eval(input())

series1=pd.Series(input_list[0])
series2=pd.Series(input_list[1])
out_list = []
for i in range(0,len(series2)):
    out_list.append(series1.index[series1==series2[i]][0])

print(out_list)

[[1,2,3,4,5,6,7],[1,3,7]]

Cleaning columns
Description
For the given dataframe, you have to clean the "Installs" column and print its correlation with other numeric columns of the dataframe.(print df.corr())
You have to do the following:
1. Remove characters like ',' from the number of installs.
2. Delete rows where the Installs column has irrelevant strings like 'Free'
3. Convert the column to int type

You can access the dataframe using the following URL in your Jupyter notebook:
https://media-doselect.s3.amazonaws.com/generic/8NMooe4G0ENEe8z9q5ZvaZA7/googleplaystore.csv
Note: You should try this problem on your own Jupyter notebook before submitting. Do not clean any column other than "Installs".
Sample Output:
            Rating  Installs
Rating    1.000000  0.051355
Installs  0.051355  1.000000
Execution Time Limit
Default.

In [131]:
import pandas as pd 
df=pd.read_csv("https://media-doselect.s3.amazonaws.com/generic/8NMooe4G0ENEe8z9q5ZvaZA7/googleplaystore.csv")
#add your cleaning code here

In [132]:
df.head()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up

In [148]:
df['Installs'] = df['Installs'].apply(lambda x: x.replace(',',''))
df['Installs'] = df['Installs'].apply(lambda x: x.replace('+',''))
df = df[df['Installs'] != 'Free']
df['Installs'] = df['Installs'].apply(pd.to_numeric)
df['Installs'].value_counts()

1000000       1579
10000000      1252
100000        1169
10000         1054
1000           907
5000000        752
100            719
500000         539
50000          479
5000           477
100000000      409
10             386
500            330
50000000       289
50             205
5               82
500000000       72
1               67
1000000000      58
0               15
Name: Installs, dtype: int64

In [150]:
print(df.corr())

            Rating  Installs
Rating    1.000000  0.051355
Installs  0.051355  1.000000

In [149]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10840 entries, 0 to 10840
Data columns (total 13 columns):
App               10840 non-null object
Category          10840 non-null object
Rating            9366 non-null float64
Reviews           10840 non-null object
Size              10840 non-null object
Installs          10840 non-null int64
Type              10839 non-null object
Price             10840 non-null object
Content Rating    10840 non-null object
Genres            10840 non-null object
Last Updated      10840 non-null object
Current Ver       10832 non-null object
Android Ver       10838 non-null object
dtypes: float64(1), int64(1), object(11)
memory usage: 1.2+ MB